---
kind: property
id: P:Autodesk.Revit.DB.GradientBackgroundSettings.SkyColor
source: html/ab874bfd-d247-0980-6dac-66d5af39bf36.htm
---
# Autodesk.Revit.DB.GradientBackgroundSettings.SkyColor Property

The color of the top of the sky.

## Syntax (C#)
```csharp
public Color SkyColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null